
// 5.
//а) Написать программу, которая запрашивает массу и рост человека, 
//вычисляет его индекс массы и сообщает, нужно ли человеку похудеть, набрать вес или всё в норме.

// I=m/(h*h); где m — масса тела в килограммах, h — рост в метрах.

Console.WriteLine ("Напиши свою массу тела и рост");

double mass = 









//б) *Рассчитать, на сколько кг похудеть или сколько кг набрать для нормализации веса.

