// 2. Написать метод подсчета количества цифр числа.
Console.Write ("Введи число: ");

string number = Console.ReadLine();

Console.Write($"Количество символов: {number.Length}");